#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.suffix: Refreshing state... [id=SSSQrpuN]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bf3fb417cc06c090]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-deny-log-group20230218215142669600000002]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-elb-sl-role-creation20230218215142674600000003]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0831935db15f73b59]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143539300000008]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143426300000006]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143411600000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143422000000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143522900000007]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-081294bae263fa00a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b07f6385db955545]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0709098e9ce9e27d7]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-066c696499116fc32]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-047399f5e0e3c0681]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-055add79182906888]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fd1907e73600a101]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01c93e0c77b884900]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ee1fa147a5facd17]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0663727d343a9f66d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3b91070834b3b49]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00d3fe6c64cb615ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-068ee5123ab8a45b0]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bd8884c594f60f5b]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-470887055]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-055add791829068881080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-081186370d79e1124]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0306ba972f000da6c]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-4004731702]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-047225cc611dbb639]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d73642770843b860]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-2509665154]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2970643229]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3551837232]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1439235237]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ac945d73c0d07ea6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00bda7d9047846864]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01cf2d353630ad2e5]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3b91070834b3b491080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-055add79182906888"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0b07f6385db955545"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                                            = "devops-ninja-vpc-public"
            "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN" = "shared"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-09be419153ce35d5c"
        id                   = "eipalloc-0831935db15f73b59"
      + network_interface    = "eni-0db752b0f831d2b02"
      + private_dns          = "ip-10-0-4-232.us-east-2.compute.internal"
      + private_ip           = "10.0.4.232"
        tags                 = {
            "Name"                                            = "devops-ninja-vpc-us-east-2a"
            "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN" = "shared"
        }
        # (8 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a3b91070834b3b49"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-081186370d79e1124"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                                            = "devops-ninja-vpc-private"
            "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN" = "shared"
        }
        # (5 unchanged attributes hidden)
    }
  # aws_security_group.worker_group_mgmt_two has been changed
  ~ resource "aws_security_group" "worker_group_mgmt_two" {
        id                     = "sg-066c696499116fc32"
        name                   = "worker_group_mgmt_two20230218215155120200000009"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # aws_security_group.all_worker_mgmt has been changed
  ~ resource "aws_security_group" "all_worker_mgmt" {
        id                     = "sg-0709098e9ce9e27d7"
        name                   = "all_worker_management2023021821515512760000000a"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # aws_security_group.worker_group_mgmt_one has been changed
  ~ resource "aws_security_group" "worker_group_mgmt_one" {
        id                     = "sg-081294bae263fa00a"
        name                   = "worker_group_mgmt_one2023021821515513680000000b"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # module.eks.aws_security_group.workers[0] has been changed
  ~ resource "aws_security_group" "workers" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow nodes all egress to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0663727d343a9f66d"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow node to communicate with each other."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-047399f5e0e3c0681",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow workers pods to receive communication from the cluster control plane."
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-047399f5e0e3c0681",
                ]
              + self             = false
              + to_port          = 65535
            },
        ]
        name                   = "devops-ninja-eks-SSSQrpuN2023021821515514620000000c"
        tags                   = {
            "Environment"                                     = "training"
            "GithubOrg"                                       = "terraform-aws-modules"
            "GithubRepo"                                      = "terraform-aws-eks"
            "Name"                                            = "devops-ninja-eks-SSSQrpuN-eks_worker_sg"
            "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN" = "owned"
        }
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_security_group.cluster[0] has been changed
  ~ resource "aws_security_group" "cluster" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow cluster egress access to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-047399f5e0e3c0681"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow pods to communicate with the EKS cluster API."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0663727d343a9f66d",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "devops-ninja-eks-SSSQrpuN2023021821515515400000000d"
        tags                   = {
            "Environment" = "training"
            "GithubOrg"   = "terraform-aws-modules"
            "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "devops-ninja-eks-SSSQrpuN-eks_cluster_sg"
        }
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_security_group_rule.workers_ingress_self[0] has been changed
  ~ resource "aws_security_group_rule" "workers_ingress_self" {
        id                       = "sgrule-4004731702"
      ~ to_port                  = 65535 -> 0
        # (8 unchanged attributes hidden)
    }
  # module.eks.aws_iam_role.cluster[0] has been changed
  ~ resource "aws_iam_role" "cluster" {
        id                    = "devops-ninja-eks-SSSQrpuN20230218215142661500000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-deny-log-group20230218215142669600000002",
          + "arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-elb-sl-role-creation20230218215142674600000003",
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "devops-ninja-eks-SSSQrpuN20230218215142661500000001"
        tags                  = {
            "Environment" = "training"
            "GithubOrg"   = "terraform-aws-modules"
            "GithubRepo"  = "terraform-aws-eks"
        }
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "devops-ninja-eks-SSSQrpuN-worker-group-1"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-01c93e0c77b884900",
          + "subnet-0ee1fa147a5facd17",
          + "subnet-0fd1907e73600a101",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "training"
        }
      + tag {
          + key                 = "GithubOrg"
          + propagate_at_launch = true
          + value               = "terraform-aws-modules"
        }
      + tag {
          + key                 = "GithubRepo"
          + propagate_at_launch = true
          + value               = "terraform-aws-eks"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "devops-ninja-eks-SSSQrpuN-worker-group-1-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/devops-ninja-eks-SSSQrpuN"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_autoscaling_group.workers[1] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "devops-ninja-eks-SSSQrpuN-worker-group-2"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-01c93e0c77b884900",
          + "subnet-0ee1fa147a5facd17",
          + "subnet-0fd1907e73600a101",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "training"
        }
      + tag {
          + key                 = "GithubOrg"
          + propagate_at_launch = true
          + value               = "terraform-aws-modules"
        }
      + tag {
          + key                 = "GithubRepo"
          + propagate_at_launch = true
          + value               = "terraform-aws-eks"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "devops-ninja-eks-SSSQrpuN-worker-group-2-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/devops-ninja-eks-SSSQrpuN"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/devops-ninja-eks-SSSQrpuN"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "devops-ninja-eks-SSSQrpuN"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::261106957109:role/devops-ninja-eks-SSSQrpuN20230218215142661500000001"
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-047399f5e0e3c0681",
            ]
          + subnet_ids                = [
              + "subnet-01c93e0c77b884900",
              + "subnet-0ee1fa147a5facd17",
              + "subnet-0fd1907e73600a101",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops-ninja-eks-SSSQrpuN"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops-ninja-eks-SSSQrpuN"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "devops-ninja-eks-SSSQrpuN"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "training"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_launch_configuration.workers[0] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = true
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-07ecd01479f8b03ec"
      + instance_type               = "t3a.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "devops-ninja-eks-SSSQrpuN-worker-group-1"
      + security_groups             = [
          + "sg-0663727d343a9f66d",
          + "sg-081294bae263fa00a",
        ]
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + throughput            = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.aws_launch_configuration.workers[1] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = true
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-07ecd01479f8b03ec"
      + instance_type               = "t3a.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "devops-ninja-eks-SSSQrpuN-worker-group-2"
      + security_groups             = [
          + "sg-0663727d343a9f66d",
          + "sg-066c696499116fc32",
        ]
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + throughput            = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_devops-ninja-eks-SSSQrpuN"
      + id                   = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint    = (known after apply)
  + cluster_id          = (known after apply)
  + config_map_aws_auth = [
      + {
          + binary_data = null
          + data        = (known after apply)
          + id          = (known after apply)
          + immutable   = null
          + metadata    = [
              + {
                  + annotations      = null
                  + generate_name    = null
                  + generation       = (known after apply)
                  + labels           = {
                      + "app.kubernetes.io/managed-by" = "Terraform"
                      + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
                    }
                  + name             = "aws-auth"
                  + namespace        = "kube-system"
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                },
            ]
        },
    ]
  + kubectl_config      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @fernandomullerjr, Action: `pull_request`*